[{"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/RozzaMalikDemoTezzeleGirfoglioStabileMola2018ECCOMAS.bib", "author": "G. Rozza, M. Haris, N. Demo, M. Tezzele, M. Girfoglio, G. Stabile, A. Mola", "booktitle": "Proceedings of the ECCOMAS Congress 2018", "organization": "ECCOMAS", "location": "Glasgow, UK", "publisher": "ECCOMAS", "title": "Advances in Reduced Order Methods for Parametric Industrial Problems in Computational Fluid Dynamics", "year": "2018", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1811.08319"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/MeneghettiDemoRozza2022ICIP.bib", "author": "L. Meneghetti, N. Demo, G. Rozza", "booktitle": "2022 IEEE International Conference on Image Processing (ICIP)", "title": "A Proper Orthogonal Decomposition Approach for Parameters Reduction of Single Shot Detector Networks", "year": "2022", "pages": "2206-2210", "eprinttype": "arXiv", "eprintclass": "cs.CV", "eprint": "2210.13416", "doi": "10.1109/ICIP46576.2022.9897513"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoStrazzulloRozza2021.bib", "title": "An extended physics informed neural network for preliminary analysis of parametric optimal control problems", "author": "N. Demo, M. Strazzullo, G. Rozza", "journal": "Computers \\& Mathematics with Applications", "volume": "143", "pages": "383-396", "year": "2023", "issn": "0898-1221", "doi": "10.1016/j.camwa.2023.05.004", "url": "https://www.sciencedirect.com/science/article/pii/S0898122123002018", "keywords": "Physics-informed neural network, Deep learning, Optimal control problem, Parametric partial differential equations", "abstract": "In this work we propose an application of physics informed supervised learning strategies to parametric partial differential equations. Indeed, even if the latter are indisputably useful in many research fields, they can be computationally expensive most of all in a real-time and many-query setting. Thus, our main goal is to provide a physics informed learning paradigm to simulate parametrized phenomena in a small amount of time. The physics information will be exploited in many ways, in the loss function (standard physics informed neural networks), as an augmented input (extra feature employment) and as a guideline to build an effective structure for the neural network (physics informed architecture). These three aspects, combined together, will lead to a faster training phase and to a more accurate parametric prediction. The methodology has been tested for several equations and also in an optimal control framework.", "eprinttype": "arXiv", "eprintclass": "cs.LG", "eprint": "2110.13530"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleRozza2018EZyRB.bib", "doi": "10.21105/joss.00661", "url": "https://doi.org/10.21105/joss.00661", "year": "2018", "month": "apr", "publisher": "The Open Journal", "volume": "3", "number": "24", "pages": "661", "author": "N. Demo, M. Tezzele, G. Rozza", "title": "EZyRB: Easy Reduced Basis method", "journal": "Journal of Open Source Software"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleRozza2023.bib", "title": "A DeepONet Multi-Fidelity Approach for Residual Learning in Reduced Order Modeling", "author": "N. Demo, M. Tezzele, G. Rozza", "year": "2023", "journal": "Advanced Modeling and Simulation in Engineering Sciences", "month": "Jul", "day": "26", "volume": "10", "number": "1", "pages": "12", "abstract": "In the present work, we introduce a novel approach to enhance the precision of reduced order models by exploiting a multi-fidelity perspective and DeepONets. Reduced models provide a real-time numerical approximation by simplifying the original model. The error introduced by the such operation is usually neglected and sacrificed in order to reach a fast computation. We propose to couple the model reduction to a machine learning residual learning, such that the above-mentioned error can be learned by a neural network and inferred for new predictions. We emphasize that the framework maximizes the exploitation of high-fidelity information, using it for building the reduced order model and for learning the residual. In this work, we explore the integration of proper orthogonal decomposition (POD), and gappy POD for sensors data, with the recent DeepONet architecture. Numerical investigations for a parametric benchmark function and a nonlinear parametric Navier-Stokes problem are presented.", "doi": "10.1186/s40323-023-00249-9", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2302.12682"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleGustinLaviniRozza2018NAV.bib", "author": "N. Demo, M. Tezzele, G. Gustin, G. Lavini, G. Rozza", "booktitle": "Technology and Science for the Ships of the Future: Proceedings of NAV 2018: 19th International Conference on Ship \\& Maritime Research", "title": "Shape Optimization by means of Proper Orthogonal Decomposition and Dynamic Mode Decomposition", "year": "2018", "doi": "10.3233/978-1-61499-870-9-212", "pages": "212--219", "publisher": "IOS Press", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1803.07368", "abstract": "Shape optimization is a challenging task in many engineering fields, since the numerical solutions of parametric system may be computationally expensive. This work presents a novel optimization procedure based on reduced order modeling, applied to a naval hull design problem. The advantage introduced by this method is that the solution for a specific parameter can be expressed as the combination of few numerical solutions computed at properly chosen parametric points. The reduced model is built using the proper orthogonal decomposition with interpolation (PODI) method. We use the free form deformation (FFD) for an automated perturbation of the shape, and the finite volume method to simulate the multiphase incompressible flow around the deformed hulls. Further computational reduction is done by the dynamic mode decomposition (DMD) technique: from few high dimensional snapshots, the system evolution is reconstructed and the final state of the simulation is faithfully approximated. Finally the global optimization algorithm iterates over the reduced space: the approximated drag and lift coefficients are projected to the hull surface, hence the resistance is evaluated for the new hulls until the convergence to the optimal shape is achieved. We will present the results obtained applying the described procedure to a typical Fincantieri cruise ship"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleRozza2021SIAM.bib", "title": "A supervised learning approach involving active subspaces for an efficient genetic algorithm in high-dimensional optimization problems", "author": "N. Demo, M. Tezzele, G. Rozza", "year": "2021", "journal": "SIAM Journal on Scientific Computing", "volume": "43", "number": "3", "pages": "B831--B853", "doi": "10.1137/20M1345219", "publisher": "SIAM,    \n    eprinttype = arXiv", "eprintclass": "math.NA", "eprint": "2006.07282"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TezzeleDemoStabileMolaRozza2020MOR.bib", "title": "Enhancing CFD predictions in shape design problems by model and parameter space reduction", "author": "M. Tezzele, N. Demo, G. Stabile, A. Mola, G. Rozza", "year": "2020", "journal": "Advanced Modeling and Simulation in Engineering Sciences", "month": "Oct", "day": "07", "volume": "7", "number": "1", "pages": "40", "abstract": "In this work we present an advanced computational pipeline for the approximation and prediction of the lift coefficient of a parametrized airfoil profile. The non-intrusive reduced order method is based on dynamic mode decomposition (DMD) and it is coupled with dynamic active subspaces (DyAS) to enhance the future state prediction of the target function and reduce the parameter space dimensionality. The pipeline is based on high-fidelity simulations carried out by the application of finite volume method for turbulent flows, and automatic mesh morphing through radial basis functions interpolation technique. The proposed pipeline is able to save 1/3 of the overall computational resources thanks to the application of DMD. Moreover exploiting DyAS and performing the regression on a lower dimensional space results in the reduction of the relative error in the approximation of the time-varying lift coefficient by a factor 2 with respect to using only the DMD.", "issn": "2213-7467", "doi": "10.1186/s40323-020-00177-y", "url": "https://doi.org/10.1186/s40323-020-00177-y", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2001.05237"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/PecileDemoTezzeleRozzaBreda2024.bib", "title": "Data-driven Discovery of Delay Differential Equations with Discrete Delays", "author": "A. Pecile, N. Demo, M. Tezzele, G. Rozza, D. Breda", "journal": "Journal of Computational and Applied Mathematics", "volume": "461", "pages": "116439", "year": "2025", "issn": "0377-0427", "doi": "https://doi.org/10.1016/j.cam.2024.116439", "url": "https://www.sciencedirect.com/science/article/pii/S0377042724006873", "keywords": "Delay differential equations, Sparse identification, Nonlinear dynamics, Unknown delays, Bayesian optimization", "abstract": "The Sparse Identification of Nonlinear Dynamics (SINDy) framework is a robust method for identifying governing equations, successfully applied to ordinary, partial, and stochastic differential equations. In this work we extend SINDy to identify delay differential equations by using an augmented library that includes delayed samples and Bayesian optimization. To identify a possibly unknown delay we minimize the reconstruction error over a set of candidates. The resulting methodology improves the overall performance by remarkably reducing the number of calls to SINDy with respect to a brute force approach. We also address a multivariate setting to identify multiple unknown delays and (non-multiplicative) parameters. Several numerical tests on delay differential equations with different long-term behavior, number of variables, delays, and parameters support the use of Bayesian optimization highlighting both the efficacy of the proposed methodology and its computational advantages. As a consequence, the class of discoverable models is significantly expanded.", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2407.19640"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/PapapiccoDemoGirfoglioStabileRozza2021.bib", "title": "The Neural Network shifted-proper orthogonal decomposition: A machine learning approach for non-linear reduction of hyperbolic equations", "journal": "Computer Methods in Applied Mechanics and Engineering", "volume": "392", "pages": "114687", "year": "2022", "issn": "0045-7825", "doi": "https://doi.org/10.1016/j.cma.2022.114687", "url": "https://www.sciencedirect.com/science/article/pii/S004578252200069X", "author": "D. Papapicco, N. Demo, M. Girfoglio, G. Stabile, G. Rozza", "keywords": "Deep Neural Networks (DNNs), Shifted-POD (sPOD), Non-linear hyperbolic equations, Reduced order modelling (ROM), Multiphase simulation", "abstract": "Models with dominant advection always posed a difficult challenge for projection-based reduced order modelling. Many methodologies that have recently been proposed are based on the pre-processing of the full-order solutions to accelerate the Kolmogorov N−width decay thereby obtaining smaller linear subspaces with improved accuracy. These methods however must rely on the knowledge of the characteristic speeds in phase space of the solution, limiting their range of applicability to problems with explicit functional form for the advection field. In this work we approach the problem of automatically detecting the correct pre-processing transformation in a statistical learning framework by implementing a deep-learning architecture. The purely data-driven method allowed us to generalise the existing approaches of linear subspace manipulation to non-linear hyperbolic problems with unknown advection fields. The proposed algorithm has been validated against simple test cases to benchmark its performances and later successfully applied to a multiphase simulation.", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2108.06558"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleMolaRozza2018ISOPE.bib", "author": "N. Demo, M. Tezzele, A. Mola, G. Rozza", "title": "An efficient shape parametrisation by free-form deformation enhanced by active subspace for hull hydrodynamic ship design problems in open source environment", "booktitle": "The 28th International Ocean and Polar Engineering Conference", "year": "2018", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1801.06369", "abstract": "In this contribution, we present the results of the application of a parameter space reduction methodology based on active subspaces to the hull hydrodynamic design problem. Several parametric deformations of an initial hull shape are considered to assess the influence of the shape parameters considered on the hull total drag. The hull resistance is typically computed by means of numerical simulations of the hydrodynamic flow past the ship. Given the high number of parameters involved - which might result in a high number of time consuming hydrodynamic simulations - assessing whether the parameters space can be reduced would lead to considerable computational cost reduction. Thus, the main idea of this work is to employ the active subspaces to identify possible lower dimensional structures in the parameter space, or to verify the parameter distribution in the position of the control points.  To this end, a fully automated procedure has been implemented to produce several small shape perturbations of an original hull CAD geometry which are then used to carry out high-fidelity flow simulations and collect data for the active subspaces analysis. To achieve full automation of the open source pipeline described, both the free form deformation methodology employed for the hull perturbations and the solver based on unsteady potential flow theory, with fully nonlinear free surface treatment, are directly interfaced with CAD data structures and operate using IGES vendor-neutral file formats as input files. The computational cost of the fluid dynamic simulations is further reduced through the application of dynamic mode decomposition to reconstruct the steady state total drag value given only few initial snapshots of the simulation. The active subspaces analysis is here applied to the geometry of the DTMB-5415 naval combatant hull, which is which is a common benchmark in ship hydrodynamics simulations."}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleMolaRozza2021JMSE.bib", "author": "N. Demo, M. Tezzele, A. Mola, G. Rozza", "title": "Hull Shape Design Optimization with Parameter Space and Model Reductions, and Self-Learning Mesh Morphing", "journal": "Journal of Marine Science and Engineering", "volume": "9", "year": "2021", "number": "2", "article-number": "185", "url": "https://www.mdpi.com/2077-1312/9/2/185", "issn": "2077-1312", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2101.03781", "doi": "10.3390/jmse9020185"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/CosciaMeneghettiDemoStabileRozza2023CM.bib", "title": "A continuous convolutional trainable filter for modelling unstructured data", "author": "D. Coscia, L. Meneghetti, N. Demo, G. Stabile, G. Rozza", "year": "2023", "journal": "Computational Mechanics", "doi": "10.1007/s00466-023-02291-1", "publisher": "Springer", "eprinttype": "arXiv", "eprintclass": "cs.LG", "eprint": "2210.13416"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TeruzziDemoRozza2023.bib", "title": "A Graph-based Framework for Complex System Simulating and Diagnosis with Automatic Reconfiguration", "author": "M. Teruzzi, N. Demo, G. Rozza", "year": "2024", "journal": "Mathematics in Engineering", "volume": "6", "number": "1", "pages": "28-44", "issn": "2640-3501", "doi": "10.3934/mine.2024002", "url": "https://www.aimspress.com/article/doi/10.3934/mine.2024002", "abstract": "In this work we present a novel approach for modeling complex industrial plants, employing directed graphs to the simulation and automatic reconfiguration after failures. The framework offers the possibility to model the failure propagation, estimating the overall condition of the system before and after the damage and exploit such a health index for dynamic recalibration. To model the typical operation of industrial plants, we propose several additions with respect to the standard graphs: i) a quantitative measure to control the overall condition of the system ii) nodes of different categories–and then different behaviors–and iii) a fault propagation procedure based on the predecessors and the redundancy of the system. The obtained graph is able to mimic the behavior of the real target plant when one or more faults occur. Additionally, we also implement a generative approach capable of activating a particular category of nodes in order to contain the issue propagation, equipping the network with the capability of reconfiguring itself and resulting in a mathematical tool useful not only for simulating and monitoring but also to design and optimize complex plants. The final asset of the system is provided in the output with its complete diagnostics and a detailed description of the steps that have been carried out to obtain the final realization.", "eprinttype": "arXiv", "eprintclass": "eess.SY", "eprint": "2302.06473", "keywords": "risk-analysis, graph-theory, fault-diagnosis, automatic reconfiguration, industrial applications, signed-directed-graphs"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/IvagnesDemoRozza2023IJNME.bib", "title": "A shape optimization pipeline for marine propellers by means of reduced order modeling techniques", "author": "A. Ivagnes, N. Demo, G. Rozza", "year": "2024", "journal": "International Journal for Numerical Methods in Engineering", "doi": "10.1002/nme.7426", "eprinttype": "arXiv", "eprintclass": "math.OC", "eprint": "2305.07515"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/CosciaDemoRozza2024.bib", "title": "Generative Adversarial Reduced Order Modelling", "author": "D. Coscia, N. Demo, G. Rozza", "journal": "Scientific Reports", "volume": "14", "year": "2024", "doi": "10.1038/s41598-024-54067-z", "url": "https://doi.org/10.1038/s41598-024-54067-z", "abstract": "In this work, we present GAROM, a new approach for reduced order modeling (ROM) based on generative adversarial networks (GANs). GANs attempt to learn to generate data with the same statistics of the underlying distribution of a dataset, using two neural networks, namely discriminator and generator. While widely applied in many areas of deep learning, little research is done on their application for ROM, i.e. approximating a high-fidelity model with a simpler one. In this work, we combine the GAN and ROM framework, introducing a data-driven generative adversarial model able to learn solutions to parametric differential equations. In the presented methodology, the discriminator is modeled as an autoencoder, extracting relevant features of the input, and a conditioning mechanism is applied to the generator and discriminator networks specifying the differential equation parameters. We show how to apply our methodology for inference, provide experimental evidence of the model generalization, and perform a convergence study of the method.", "eprinttype": "arXiv", "eprintclass": "cs.LG", "eprint": "2305.15881"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TezzeleDemoGadallaMolaRozza2018NAV.bib", "author": "M. Tezzele, N. Demo, M. Gadalla, A. Mola, G. Rozza", "booktitle": "Technology and Science for the Ships of the Future: Proceedings of NAV 2018: 19th International Conference on Ship \\& Maritime Research", "doi": "10.3233/978-1-61499-870-9-569", "pages": "569--576", "publisher": "IOS Press", "title": "Model order reduction by means of active subspaces and dynamic mode decomposition for parametric hull shape design hydrodynamics", "year": "2018", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1803.07377", "abstract": "We present the results of the application of a parameter space reduction methodology based on active subspaces (AS) to the hull hydrodynamic design problem. Several parametric deformations of an initial hull shape are considered to assess the influence of the shape parameters on the hull wave resistance. Such problem is relevant at the preliminary stages of the ship design, when several flow simulations are carried out by the engineers to establish a certain sensibility with respect to the parameters, which might result in a high number of time consuming hydrodynamic simulations.  The main idea of this work is to employ the AS to identify possible lower dimensional structures in the parameter space. The complete pipeline involves the use of free form deformation to parametrize and deform the hull shape, the high fidelity solver based on unsteady potential flow theory with fully nonlinear free surface treatment directly interfaced with CAD, the use of dynamic mode decomposition to reconstruct the final steady state given only few snapshots of the simulation, and the reduction of the parameter space by AS, and shared subspace. Response surface method is used to minimize the total drag."}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleStabileRozzaCH19.bib", "author": "N. Demo, M. Tezzele, G. Stabile, G. Rozza", "title": "Chapter 19: Scientific Software Development and Packages for Reduced Order Models in Computational Fluid Dynamics", "booktitle": "Advanced Reduced Order Methods and Applications in Computational Fluid Dynamics", "pages": "379-387", "year": "2022", "doi": "10.1137/1.9781611977257.ch19", "url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611977257.ch19"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoOrtaliGustinRozzaLavini2020BUMI.bib", "title": "An efficient computational framework for naval shape design and optimization problems by means of data-driven reduced order modeling techniques", "author": "N. Demo, G. Ortali, G. Gustin, G. Rozza, G. Lavini", "year": "2020", "journal": "Bollettino dell'Unione Matematica Italiana", "month": "Nov", "day": "06", "abstract": "This contribution describes the implementation of a data-driven shape optimization pipeline in a naval architecture application. We adopt reduced order models in order to improve the efficiency of the overall optimization, keeping a modular and equation-free nature to target the industrial demand. We applied the above mentioned pipeline to a realistic cruise ship in order to reduce the total drag. We begin by defining the design space, generated by deforming an initial shape in a parametric way using free form deformation. The evaluation of the performance of each new hull is determined by simulating the flux via finite volume discretization of a two-phase (water and air) fluid. Since the fluid dynamics model can result very expensive---especially dealing with complex industrial geometries---we propose also a dynamic mode decomposition enhancement to reduce the computational cost of a single numerical simulation. The real-time computation is finally achieved by means of proper orthogonal decomposition with Gaussian process regression technique. Thanks to the quick approximation, a genetic optimization algorithm becomes feasible to converge towards the optimal shape.", "issn": "2198-2759", "doi": "10.1007/s40574-020-00263-4", "url": "https://doi.org/10.1007/s40574-020-00263-4", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2004.11201"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TezzeleDemoRozza2019MARINE.bib", "author": "M. Tezzele, N. Demo, G. Rozza", "title": "Shape optimization through proper orthogonal decomposition with interpolation and dynamic mode decomposition enhanced by active subspaces", "booktitle": "VIII International Conference on Computational Methods in Marine Engineering", "year": "2019", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1905.05483", "abstract": "We propose a numerical pipeline for shape optimization in naval engineering involving two different non-intrusive reduced order method (ROM) techniques. Such methods are proper orthogonal decomposition with interpolation (PODI) and dynamic mode decomposition (DMD). The ROM proposed will be enhanced by active subspaces (AS) as a pre-processing tool that reduce the parameter space dimension and suggest better sampling of the input space. We will focus on geometrical parameters describing the perturbation of a reference bulbous bow through the free form deformation (FFD) technique. The ROM are based on a finite volume method (FV) to simulate the multi-phase incompressible flow around the deformed hulls. In previous works we studied the reduction of the parameter space in naval engineering through AS [38, 10] focusing on different parts of the hull. PODI and DMD have been employed for the study of fast and reliable shape optimization cycles on a bulbous bow in [9]. The novelty of this work is the simultaneous reduction of both the input parameter space and the output fields of interest. In particular AS will be trained computing the total drag resistance of a hull advancing in calm water and its gradients with respect to the input parameters. DMD will improve the performance of each simulation of the campaign using only few snapshots of the solution fields in order to predict the regime state of the system. Finally PODI will interpolate the coefficients of the POD decomposition of the output fields for a fast approximation of all the fields at new untried parameters given by the optimization algorithm. This will result in a non-intrusive data-driven numerical optimization pipeline completely independent with respect to the full order solver used and it can be easily incorporated into existing numerical pipelines, from the reference CAD to the optimal shape."}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/OrtaliGabbanaDemoRozzaToschi2025.bib", "title": "Kinetic Data-Driven Approach to Turbulence Subgrid Modeling", "author": "G. Ortali, A. Gabbana, N. Demo, G. Rozza, F. Toschi", "journal": "Phys. Rev. Res.", "volume": "7", "number": "3", "abstract": "Numerical simulations of turbulent flows are well known to pose extreme computational challenges because of the huge number of dynamical degrees of freedom required to correctly describe the complex multiscale statistical correlations of the velocity. On the other hand, kinetic mesoscale approaches based on the Boltzmann equation, have the potential to describe a broad range of flows, stretching well beyond the special case of gases close to equilibrium, which results in the ordinary Navier-Stokes dynamics. Here, we demonstrate that, by properly tuning, a kinetic approach can statistically reproduce the quantitative dynamics of the larger scales in turbulence, thereby providing an alternative, computationally efficient and physically rooted approach toward subgrid scale (SGS) modeling in turbulence. More specifically, we show that by leveraging data from fully resolved direct numerical simulation (DNS), we can learn a collision operator for the discretized Boltzmann equation solver (the lattice Boltzmann method), which effectively implies a turbulence subgrid closure model. The mesoscopic nature of our formulation makes the learning problem fully local in both space and time, leading to reduced computational costs and enhanced generalization capabilities. We show that the model offers superior performance compared to traditional methods, such as the Smagorinsky model, being less dissipative and, therefore, able to more closely capture the intermittency of higher-order velocity correlations. This foundational study lays the basis for extending the proposed framework to different turbulent flow settings and—most importantly—to develop new classes of hybrid data-driven kinetic-based models capable of faithfully capturing the complex macroscopic dynamics of diverse physical systems such as emulsions, non-Newtonian fluid, and multiphase systems.", "eprinttype": "arXiv", "eprintclass": "physics.flu-dyn", "eprint": "2403.18466", "issue": "1", "pages": "013202", "numpages": "6", "year": "2025", "month": "Feb", "publisher": "American Physical Society", "doi": "10.1103/PhysRevResearch.7.013202"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/MeneghettiDemoRozza2021.bib", "title": "A Dimensionality Reduction Approach for Convolutional Neural Networks", "author": "L. Meneghetti, N. Demo, G. Rozza", "eprinttype": "arXiv", "eprintclass": "cs.LG", "eprint": "2110.09163", "journal": "Applied Intelligence", "year": "2023", "month": "Oct", "day": "01", "volume": "53", "number": "19", "pages": "22818-22833", "abstract": "The focus of this work is on the application of classical Model Order Reduction techniques, such as Active Subspaces and Proper Orthogonal Decomposition, to Deep Neural Networks. We propose a generic methodology to reduce the number of layers in a pre-trained network by combining the aforementioned techniques for dimensionality reduction with input-output mappings, such as Polynomial Chaos Expansion and Feedforward Neural Networks. The motivation behind compressing the architecture of an existing Convolutional Neural Network arises from its usage in embedded systems with specific storage constraints. The conducted numerical tests demonstrate that the resulting reduced networks can achieve a level of accuracy comparable to the original Convolutional Neural Network being examined, while also saving memory allocation. Our primary emphasis lies in the field of image recognition, where we tested our methodology using VGG-16 and ResNet-110 architectures against three different datasets: CIFAR-10, CIFAR-100, and a custom dataset.", "issn": "1573-7497", "doi": "10.1007/s10489-023-04730-1"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/RoznowiczStabileDemoFransosRozza2024.bib", "title": "Large-scale graph-machine-learning surrogate models for 3D-flowfield prediction in external aerodynamics", "journal": "Advanced Modeling and Simulation in Engineering Sciences", "year": "2024", "issn": "2213-7467", "doi": "https://doi.org/10.1186/s40323-024-00259-1", "url": "https://amses-journal.springeropen.com/articles/10.1186/s40323-024-00259-1", "author": "D. Roznowicz, G. Stabile, N. Demo, D. Fransos, G. Rozza", "keywords": "Computational fluid dynamics, Graph machine learning, External aerodynamics, Large scale model, 3D surrogate model", "abstract": "The article presents the application of inductive graph machine learning surrogate models for accurate and efficient prediction of 3D flow for industrial geometries, explicitly focusing here on external aerodynamics for a motorsport case. The final aim is to build a surrogate model that can provide quick predictions, bypassing in this way the unfeasible computational burden of traditional computational fluid dynamics (CFD) simulations. We investigate in this contribution the usage of graph neural networks, given their ability to smoothly deal with unstructured data, which is the typical context for industrial simulations. We integrate an efficient subgraph-sampling approach with our model, specifically tailored for large dataset training. REV-GNN is the chosen graph machine learning model, that stands out for its capacity to extract deeper insights from neighboring graph regions. Additionally, its unique feature lies in its reversible architecture, which allows keeping the memory usage constant while increasing the number of network layers. We tested the methodology by applying it to a parametric Navier–Stokes problem, where the parameters control the surface shape of the industrial artifact at hand, here a motorbike."}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TezzeleDemoMolaRozza2018.bib", "title": "An integrated data-driven computational pipeline with model order reduction for industrial and applied mathematics", "author": "M. Tezzele, N. Demo, A. Mola, G. Rozza", "editor": "Michael G\\\"unther and Wil Schilders Wil", "booktitle": "Novel Mathematics Inspired by Industrial Challenges", "year": "2022", "publisher": "Springer International Publishing", "pages": "179--200", "abstract": "In this work we present an integrated computational pipeline involving several model order reduction techniques for industrial and applied mathematics, as emerging technology for product and/or process design procedures. Its data-driven nature and its modularity allow an easy integration into existing pipelines.", "isbn": "978-3-030-96173-2", "doi": "10.1007/978-3-030-96173-2_7", "url": "https://doi.org/10.1007/978-3-030-96173-2_7", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1810.12364"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleRozza2019CRM.bib", "doi": "10.1016/j.crme.2019.11.012", "url": "https://doi.org/10.1016/j.crme.2019.11.012", "year": "2019", "month": "nov", "publisher": "Elsevier BV", "volume": "347", "number": "11", "pages": "873--881", "author": "N. Demo, M. Tezzele, G. Rozza", "title": "A non-intrusive approach for the reconstruction of POD modal coefficients through active subspaces", "journal": "Comptes Rendus M\\'ecanique", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1907.12777", "abstract": "Reduced order modeling (ROM) provides an efficient framework to compute solutions of parametric problems. Basically, it exploits a set of precomputed high-fidelity solutions --- computed for properly chosen parameters, using a full-order model --- in order to find the low dimensional space that contains the solution manifold. Using this space, an approximation of the numerical solution for new parameters can be computed in real-time response scenario, thanks to the reduced dimensionality of the problem. In a ROM framework, the most expensive part from the computational viewpoint is the calculation of the numerical solutions using the full-order model. Of course, the number of collected solutions is strictly related to the accuracy of the reduced order model. In this work, we aim at increasing the precision of the model also for few input solutions by coupling the proper orthogonal decomposition with interpolation (PODI) --- a data-driven reduced order method --- with the active subspace (AS) property, an emerging tool for reduction in parameter space. The enhanced ROM results in a reduced number of input solutions to reach the desired accuracy. In this contribution, we present the numerical results obtained by applying this method to a structural problem and in a fluid dynamics one."}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/MolaDemoTezzeleRozzaCH17.bib", "author": "A. Mola, N. Demo, M. Tezzele, G. Rozza", "title": "Chapter 17: Geometrical Parametrization and Morphing Techniques with Applications", "booktitle": "Advanced Reduced Order Methods and Applications in Computational Fluid Dynamics", "pages": "345-364", "doi": "10.1137/1.9781611977257.ch17", "year": "2022", "url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611977257.ch17"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/GarottaDemoTezzeleCarraturoRealiRozza2018.bib", "title": "Reduced Order Isogeometric Analysis Approach for PDEs in Parametrized Domains", "author": "F. Garotta, N. Demo, M. Tezzele, M. Carraturo, A. Reali, G. Rozza", "editor": "Marta D'Elia and Max Gunzburger and Gianluigi Rozza", "booktitle": "Quantification of Uncertainty: Improving Efficiency and Technology: QUIET selected contributions", "year": "2020", "publisher": "Springer International Publishing", "pages": "153--170", "abstract": "In this contribution, we coupled the isogeometric analysis to a reduced order modelling technique in order to provide a computationally efficient solution in parametric domains. In details, we adopt the free-form deformation method to obtain the parametric formulation of the domain and proper orthogonal decomposition with interpolation for the computational reduction of the model. This technique provides a real-time solution for any parameter by combining several solutions, in this case computed using isogeometric analysis on different geometrical configurations of the domain, properly mapped into a reference configuration. We underline that this reduced order model requires only the full-order solutions, making this approach non-intrusive. We present in this work the results of the application of this methodology to a heat conduction problem inside a deformable collector pipe.", "isbn": "978-3-030-48721-8", "doi": "10.1007/978-3-030-48721-8_7", "url": "https://doi.org/10.1007/978-3-030-48721-8_7", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1811.08631"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/OrtaliDemoRozza2020MINE.bib", "title": "Gaussian process approach within a data-driven POD framework for fluid dynamics engineering problems", "author": "G. Ortali, N. Demo, G. Rozza", "year": "2022", "journal": "Mathematics in Engineering", "volume": "4", "number": "3", "doi": "10.3934/mine.2022021", "pages": "1--16", "eprint": "2012.01989", "eprinttype": "arXiv", "eprintclass": "math.NA"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/MeneghettiShahGirfoglioDemoTezzeleLarioStabileRozzaCH20.bib", "author": "L. Meneghetti, N. Shah, M. Girfoglio, N. Demo, M. Tezzele, A. Lario, G. Stabile, G. Rozza", "title": "Chapter 20: A Deep Learning Approach to Improving Reduced Order Models", "booktitle": "Advanced Reduced Order Methods and Applications in Computational Fluid Dynamics", "pages": "389-413", "doi": "10.1137/1.9781611977257.ch20", "year": "2022", "url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611977257.ch20", "eprint": "https://epubs.siam.org/doi/pdf/10.1137/1.9781611977257.ch20"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/IchinagaAndreuzziDemoTezzeleLapoRozzaBruntonKutz2024.bib", "title": "PyDMD: A Python Package for Robust Dynamic Mode Decomposition", "author": "S. Ichinaga, F. Andreuzzi, N. Demo, M. Tezzele, K. Lapo, G. Rozza, S. Brunton, N. Kutz", "year": "2024", "eprinttype": "arXiv", "eprintclass": "stat.CO", "eprint": "2402.07463"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TezzeleDemoMolaRozza2020PyGeM.bib", "title": "PyGeM: Python Geometrical Morphing", "journal": "Software Impacts", "pages": "100047", "year": "2020", "issn": "2665-9638", "doi": "https://doi.org/10.1016/j.simpa.2020.100047", "url": "http://www.sciencedirect.com/science/article/pii/S2665963820300385", "author": "M. Tezzele, N. Demo, A. Mola, G. Rozza", "keywords": "Free form deformation, Radial basis functions interpolation, Inverse distance weighting, Geometrical morphing, Python"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/CosciaWellingDemoRozza2025.bib", "title": "BARNN: A Bayesian Autoregressive and Recurrent Neural Network", "author": "D. Coscia, M. Welling, N. Demo, G. Rozza", "year": "2025", "eprinttype": "arXiv", "eprintclass": "cs.LG", "eprint": "2501.18665"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/AndreuzziDemoRozza2021.bib", "title": "A Dynamic Mode Decomposition Extension for the Forecasting of Parametric Dynamical Systems", "author": "F. Andreuzzi, N. Demo, G. Rozza", "journal": "SIAM Journal on Applied Dynamical Systems", "volume": "22", "number": "3", "pages": "2432-2458", "year": "2023", "doi": "10.1137/22M1481658", "abstract": "Dynamic mode decomposition (DMD) has recently become a popular tool for the nonintrusive analysis of dynamical systems. Exploiting proper orthogonal decomposition (POD) as a dimensionality reduction technique, DMD is able to approximate a dynamical system as a sum of spatial bases evolving linearly in time, thus enabling a better understanding of the physical phenomena and forecasting of future time instants. In this work we propose an extension of DMD to parameterized dynamical systems, focusing on the future forecasting of the output of interest in a parametric context. Initially all the snapshots—for different parameters and different time instants—are projected to a reduced space; then DMD, or one of its variants, is employed to approximate reduced snapshots for future time instants. Exploiting the low dimension of the reduced space, we then combine the predicted reduced snapshots using regression techniques, thus enabling the possibility of approximating any untested parametric configuration in the future. This paper depicts in detail the algorithmic core of this method; we also present and discuss three test cases for our algorithm: a simple dynamical system with a linear parameter dependency, a heat problem with nonlinear parameter dependency, and a fluid dynamics problem with nonlinear parameter dependency.", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2110.09155"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/CosciaIvagnesDemoRozza2023PINA.bib", "doi": "10.21105/joss.05352", "url": "https://doi.org/10.21105/joss.05352", "year": "2023", "publisher": "The Open Journal", "author": "D. Coscia, A. Ivagnes, N. Demo, G. Rozza", "title": "Physics-Informed Neural networks for Advanced modeling", "journal": "Journal of Open Source Software"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/IvagnesDemoRozza2023JSC.bib", "title": "Towards a Machine Learning Pipeline in Reduced Order Modelling for Inverse Problems: Neural Networks for Boundary Parametrization, Dimensionality Reduction and Solution Manifold Approximation", "author": "A. Ivagnes, N. Demo, G. Rozza", "year": "2023", "journal": "Journal of Scientific Computing", "volume": "95", "number": "23", "doi": "10.1007/s10915-023-02142-4", "publisher": "Springer", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "2210.14764"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleMolaRozza2019MARINE.bib", "author": "N. Demo, M. Tezzele, A. Mola, G. Rozza", "title": "A complete data-driven framework for the efficient solution of parametric shape design and optimisation in naval engineering problems", "year": "2019", "booktitle": "VIII International Conference on Computational Methods in Marine Engineering", "eprinttype": "arXiv", "eprintclass": "math.NA", "eprint": "1905.05982"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/DemoTezzeleRozza2018PyDMD.bib", "doi": "10.21105/joss.00530", "url": "https://doi.org/10.21105/joss.00530", "year": "2018", "month": "feb", "publisher": "The Open Journal", "volume": "3", "number": "22", "pages": "530", "author": "N. Demo, M. Tezzele, G. Rozza", "title": "PyDMD: Python Dynamic Mode Decomposition", "journal": "Journal of Open Source Software"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/CaloreDemoSchifanoTripiccione2016PPAM.bib", "author": "E. Calore, N. Demo, S. Fabio, R. Tripiccione", "title": "Experience on Vectorizing Lattice Boltzmann Kernels for Multi- and Many-Core Architectures", "booktitle": "Parallel Processing and Applied Mathematics", "year": "2016", "publisher": "Springer International Publishing", "pages": "53--62", "abstract": "Current development trends of fast processors calls for an increasing number of cores, each core featuring wide vector processing units. Applications must then exploit both directions of parallelism to run efficiently. In this work we focus on the efficient use of vector instructions. These process several data-elements in parallel, and memory data layout plays an important role to make this efficient. An optimal memory-layout depends in principle on the access patterns of the algorithm but also on the architectural features of the processor. However, different parts of the application may have different requirements, and then the choice of the most efficient data-structure for vectorization has to be carefully assessed. We address these problems for a Lattice Boltzmann (LB) code, widely used in computational fluid-dynamics. We consider a state-of-the-art two-dimensional LB model, that accurately reproduces the thermo-hydrodynamics of a 2D-fluid. We write our codes in C and expose vector parallelism using directive-based programming approach. We consider different data layouts and analyze the corresponding performance. Our results show that, if an appropriate data layout is selected, it is possible to write a code for this class of applications that is automatically vectorized and performance portable on several architectures. We end up with a single code that runs efficiently onto traditional multi-core processors as well as on recent many-core systems such as the Xeon-Phi.", "isbn": "978-3-319-32149-3", "doi": "10.1007/978-3-319-32149-3_6", "url": "https://doi.org/10.1007/978-3-319-32149-3_6"}, {"bibitem": "https://raw.githubusercontent.com/ndem0/pubblications/master/bibitems/TezzeleDemoStabileRozzaCH9.bib", "author": "M. Tezzele, N. Demo, G. Stabile, G. Rozza", "title": "Chapter 9: Nonintrusive Data-Driven Reduced Order Models in Computational Fluid Dynamics", "booktitle": "Advanced Reduced Order Methods and Applications in Computational Fluid Dynamics", "pages": "203-222", "year": "2022", "doi": "10.1137/1.9781611977257.ch9", "url": "https://epubs.siam.org/doi/abs/10.1137/1.9781611977257.ch9", "eprint": "https://epubs.siam.org/doi/pdf/10.1137/1.9781611977257.ch9"}]